In [1]:
a=10
b=30
c=a+b
c

40

In [ ]:
=========================EDA==============================
1) Pandas  : Data frame application.

2) Numpy   :Numerical python All math application.

3) Matplotlib:used for plotting.

4) Seaborn  :used for plot.

5) plotly   :use for plot

6) Bokhe    :plot

==============================Machine learning==============
7) Sickit-learn:  sklearn

==============================Deep learning=============================
8) Tensorflow  : Google

9) Keras       : Google

10) Pytorch     : Facebook

====================================NLP===============================
11) NLTK       :Natural language tool kit

12) Scipy

===================================BERT==================================
13) Transformers  :  Hugging face(Google)

===================================Google models=================================
14) Specific google packages


==========================Azure ML===========================================
15) Azure packages


=========================GenAI========================================
16) Geminiai    : Google

17) ChatGPT     :OpenAI

=========================LangChain=======================================
18) LangChain packages

**Create a dataframe using list**

- list === dictionary

- dictionary === list

$Step-1$:

**Create a dataframe**

In [3]:
import pandas as pd
names=['Ayush', 'Shivam', 'Gourav']
pd.DataFrame( )      # empty dataframe now rows and no columns

Empty DataFrame
Columns: []
Index: []

Step-2:

**Provide the data**

In [5]:
import pandas as pd
names=['Ayush', 'Shivam', 'Gourav']
pd.DataFrame(names)

        0
0   Ayush
1  Shivam
2  Gourav

In [29]:
import pandas as pd
names=['Ayush', 'Shivam', 'Gourav']
age=[25,30,35] 
pd.DataFrame(names,age)
# What is the first positional argument: data
# second positional arguments : index

         0
25   Ayush
30  Shivam
35  Gourav

In [6]:
names=['Ayush', 'Shivam', 'Gourav']
age=[25,30,35]
pd.DataFrame(zip(names,age))
# What is the first positional argument: data
# second positional arguments : index

        0   1
0   Ayush  25
1  Shivam  30
2  Gourav  35

In [7]:
names=['Ayush', 'Shivam', 'Gourav']
age=[25,30,35]
city=['Hyd', 'blr', 'chennai']
data=zip(names,age)
pd.DataFrame(data,city)

              0   1
Hyd       Ayush  25
blr      Shivam  30
chennai  Gourav  35

$Step-3$:

**Provide the column names**

In [8]:
names=['Ayush', 'Shivam', 'Gourav']
age=[25,30,35]
pd.DataFrame(zip(names,age),columns=['Names','Age'])

    Names  Age
0   Ayush   25
1  Shivam   30
2  Gourav   35

Step-3:

**Provide the column names**`

In [9]:
names=['Ayush', 'Shivam', 'Gourav']
age=[25,30,35]
pd.DataFrame(zip(names,age),
             columns=['Names','Age'])

    Names  Age
0   Ayush   25
1  Shivam   30
2  Gourav   35

In [33]:
names=['Ayush', 'Shivam', 'Gourav']
age=[25,30,35]
city=['hyd', 'blr', 'chennai']

data=zip(names,age,city)
cols=['Names','Age','City']
pd.DataFrame(data,columns=cols)

    Names  Age     City
0   Ayush   25      hyd
1  Shivam   30      blr
2  Gourav   35  chennai

In [14]:
names=['Ayush', 'Shivam', 'Gourav']
age=[25,30,35]
city=['hyd', 'blr', 'chennai']

data=zip(names,age,city)
cols=['Names','Age','City']
df=pd.DataFrame(data,columns=cols)

In [15]:
type(df)

pandas.core.frame.DataFrame

$Step-4$

**ADD new column**

- If you want to add new column

- First you need to check the number of rows in already existed data
- For example in above the dataframe has 3 rows
- You need to create a new list with 3 rows
- that list equate to the data frame

In [16]:
job=['DS','DE','CS']
df['JOB']=job
df

    Names  Age     City JOB
0   Ayush   25      hyd  DS
1  Shivam   30      blr  DE
2  Gourav   35  chennai  CS

In [17]:
mob=[9977048192,9171245845,9575544266]
df['MOB']=mob
df

    Names  Age     City JOB         MOB
0   Ayush   25      hyd  DS  9977048192
1  Shivam   30      blr  DE  9171245845
2  Gourav   35  chennai  CS  9575544266

$Step-5$

**Update the already existed columns**

- Create new column and update new column both are same way

In [18]:
df['Age']=[35,40,45]
df

    Names  Age     City JOB         MOB
0   Ayush   35      hyd  DS  9977048192
1  Shivam   40      blr  DE  9171245845
2  Gourav   45  chennai  CS  9575544266

$Step-6$

**Change the index**

In [19]:
import pandas as pd
names=['Ayush', 'Shivam', 'Gourav','krishna']
age=[25,30,35,22]
city=['hyd','blr','chennai','mumbai']

data=zip(names,age,city)
cols=['Names','Age','City']
idx=['A','B','C','D']
df=pd.DataFrame(data,
                index=idx,
                columns=cols)
df

     Names  Age     City
A    Ayush   25      hyd
B   Shivam   30      blr
C   Gourav   35  chennai
D  krishna   22   mumbai

**Note**

- Number of list equals  to **Number of columns**

- Number of values inside list equals to **Number of rows**
 
- When you create the data all the lists will be of same length

$Step-7$

**Shape**

- Number of rows

- Number of columns

In [20]:
df.shape
# Matrix format
# 4 rows and 3 columns
print("The number of rows are:",df.shape[0])
print("The number of columns are:",df.shape[1])

The number of rows are: 4
The number of columns are: 3

$Step-8$

**Drop the column**

- In order to drop column we required 3 arguments 

- Column name

   - The column name we need to mention

- axis

    - axis=0  **represents rows**

    - axis=1  **represents columns**

- inplace

   - We are drop column means we are modifying the dataframe

   - so this modifications we want to save in same variable or different variable

   - if you want to keep in the same variable the **inplace-True**

In [21]:
df

     Names  Age     City
A    Ayush   25      hyd
B   Shivam   30      blr
C   Gourav   35  chennai
D  krishna   22   mumbai

In [22]:
df.drop('City',
        axis=1,
        inplace=True)

In [23]:
df

     Names  Age
A    Ayush   25
B   Shivam   30
C   Gourav   35
D  krishna   22

In [24]:
df1=df.drop('Age',
        axis=1)  #do not give inplace=True

In [25]:
df # has has 4 columns

     Names  Age
A    Ayush   25
B   Shivam   30
C   Gourav   35
D  krishna   22

In [26]:
df1

     Names
A    Ayush
B   Shivam
C   Gourav
D  krishna

In [27]:
import pandas as pd
names=['Ayush', 'Shivam', 'Gourav']
age=[25,30,35]
city=['hyd','blr','chennai']

data=zip(names,age,city)
cols=['Names','Age','City']
idx=['A','B','C']
df=pd.DataFrame(data,index=idx,columns=cols)
df

    Names  Age     City
A   Ayush   25      hyd
B  Shivam   30      blr
C  Gourav   35  chennai

$Step-9$-

**Multiple columns drop**

In [28]:
# again read the data
import pandas as pd

names=['Ayush', 'Shivam', 'Gourav']
age=[25,30,35]
city=['hyd','blr','chennai']

data=zip(names,age,city)
cols=['Names','Age','City']
idx=['A','B','C']

df=pd.DataFrame(data,
                index=idx,
                columns=cols)
df

    Names  Age     City
A   Ayush   25      hyd
B  Shivam   30      blr
C  Gourav   35  chennai

In [29]:
df.drop(['Age','City'],axis=1,inplace=True)
df

    Names
A   Ayush
B  Shivam
C  Gourav

$Step-10$

**Drop the rows**

In [30]:
# again read the data
import pandas as pd

names=['Ayush', 'Shivam', 'Gourav']
age=[25,30,35]
city=['hyd','blr','chennai']

data=zip(names,age,city)
cols=['Names','Age','City']
idx=['A','B','C']

df=pd.DataFrame(data,
                index=idx,
                columns=cols)
df

    Names  Age     City
A   Ayush   25      hyd
B  Shivam   30      blr
C  Gourav   35  chennai

In [31]:
df.drop('A',axis=0,inplace=True)
df

    Names  Age     City
B  Shivam   30      blr
C  Gourav   35  chennai

$Step-11$

**How to save the data frame**

- Generally data frames are of two types

- csv(Comma seperated value)

- excel

In [47]:
# file name =data
# extension=.csv
df.to_csv('data.csv')
df.to_csv('data1.csv',index=False)

In [46]:
# Extension
# .xlsx
df.to_excel("data2.xlsx",index=False)